{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Metadata report describing a feature related to removing example text from the AnniversaryGate UI.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend components, utilities, hooks, and styles.",
  "frontend/index.css": "Global Tailwind-based style layer defining color variables, dark mode overrides, and base element styling.",
  "frontend/index.html": "Root HTML template loading the React app entry script.",
  "frontend/src/App.tsx": "Main React component gating access behind AnniversaryGate and rendering the Valentine's Week UI once unlocked.",
  "frontend/src/components/AnniversaryGate.tsx": "Form-based gate that validates a text anniversary date input and unlocks the app on success.",
  "frontend/src/components/ValentineDayCard.tsx": "Card component showing each Valentine's day, handling locked/unlocked states and displaying the day's message when available.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth context and provider offering identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder hook file as no backend queries are required.",
  "frontend/src/index.css": "Defines Tailwind layers plus custom CSS variables, dark mode palettes, base styles, and romantic-themed utility classes.",
  "frontend/src/lib/anniversaryGate.ts": "Provides functions to normalize date input and validate it against the expected anniversary date.",
  "frontend/src/lib/dateLocking.ts": "Contains helpers to determine if a date is unlocked and to return a user-friendly unlock label.",
  "frontend/src/lib/valentinesSchedule.ts": "Defines the ValentineDay interface and a schedule of Valentine’s Week days with unlock dates, messages, and icon indices.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, theme extensions using CSS variables, custom colors, animations, and plugins.",
  "project_state.json": "Stores project metadata, versioning, features, requirements, and architectural notes for the Valentine’s Week site."
}