{
  "kind": "build_request",
  "title": "Add an apology note to the first day’s greeting only",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Update the Valentine’s Week schedule so that only the first day (Rose Day / id: \"rose-day\") includes an additional apology note in the unlocked greeting message. The apology note text must be in English and must express: \"sorry for all the mistakes I have done before and I'll try to improve myself\". No other day’s greeting message should include this apology note.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Also add a sorry note for all the mistakes I have done before and I'll try to improve myself.\n\n\nAdd this note on the first day only"
        ]
      },
      "acceptanceCriteria": [
        "When Rose Day is unlocked, its displayed message includes the added apology note (in English) in addition to the existing Rose Day message.",
        "When any other day (Propose Day through Valentine’s Day) is unlocked, its displayed message remains unchanged and does not include the apology note.",
        "The change is implemented via the schedule data (frontend/src/lib/valentinesSchedule.ts) so the UI (frontend/src/components/ValentineDayCard.tsx) renders it automatically without additional conditional UI logic."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not change date-locking/unlock logic (unlocking must continue to be driven by each day’s existing unlockDate)."
  ],
  "nonGoals": [
    "Do not add new days/cards or change the schedule ordering.",
    "Do not modify the anniversary gate behavior or validation date."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}